#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Image-Labels-Generator/runs/run-5sefNbYuaRonESDZ

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
random_id.bucket_id: Refreshing state... [id=ChUmMA]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=162fb6bc0ede0b1c66ffba50be78815ce71c11fb]
aws_iam_policy.rekognition_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy]
aws_iam_role.lambda_role: Refreshing state... [id=rekognition-image-labels-lambda-role]
aws_sqs_queue.lambda_dlq: Refreshing state... [id=https://sqs.ap-southeast-1.amazonaws.com/871308866502/rekognition-image-labels-lambda-dlq]
aws_s3_bucket.images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-0a152630]
aws_iam_role_policy_attachment.lambda_attach_rekognition: Refreshing state... [id=rekognition-image-labels-lambda-role-20260117164825199600000002]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=rekognition-image-labels-lambda-role-20260117164825012000000001]
aws_iam_role_policy.lambda_sqs_policy: Refreshing state... [id=rekognition-image-labels-lambda-role:LambdaSQSPolicy]
aws_s3_bucket_public_access_block.images_bucket_access: Refreshing state... [id=rekognition-image-labels-images-bucket-0a152630]
aws_s3_bucket_versioning.versioning_images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-0a152630]
aws_iam_policy.rekognition_s3_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy]
aws_s3_bucket_server_side_encryption_configuration.sse: Refreshing state... [id=rekognition-image-labels-images-bucket-0a152630]
aws_lambda_function.rekognition_lambda: Refreshing state... [id=rekognition-image-labels-rekognition-lambda]
aws_s3_bucket_lifecycle_configuration.images_bucket_lifecycle: Refreshing state... [id=rekognition-image-labels-images-bucket-0a152630]
aws_iam_role_policy_attachment.lambda_attach_s3: Refreshing state... [id=rekognition-image-labels-lambda-role-20260117164831046600000003]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.rekognition_lambda has changed
  ~ resource "aws_lambda_function" "rekognition_lambda" {
      + arn                            = "arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda"
        id                             = "rekognition-image-labels-rekognition-lambda"
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/rekognition-image-labels-rekognition-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "rekognition-image-labels-lambda-log-group"
        }
      + tags_all          = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-lambda-log-group"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
    }

  # aws_lambda_function.rekognition_lambda is tainted, so must be replaced
-/+ resource "aws_lambda_function" "rekognition_lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda" -> (known after apply)
      ~ code_sha256                    = "ZhzWYR64KWD0JsLBn1mhpbO0x4jW47GXUTrZyZkyckc=" -> (known after apply)
      ~ id                             = "rekognition-image-labels-rekognition-lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2026-01-17T17:03:57.951+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 708 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/rekognition-image-labels-rekognition-lambda" -> null
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "rekognition-image-labels-rekognition-lambda"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::rekognition-image-labels-images-bucket-0a152630"
      + statement_id        = "AllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = "rekognition-image-labels-images-bucket-0a152630"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

```

</details>